using QFramework;

namespace UG20260527
{
    public interface ITrafficGameModel : IModel
    {
        /* ---------------------------------------------- 数据 --------------------------------------------- */

        /// <summary>
        /// 当前血量
        /// </summary>
        public BindableProperty<int> HP { get; set; }


        /* ---------------------------------------------- 函数 --------------------------------------------- */

        /// <summary>
        /// 初始化 Model局内数据
        /// </summary>
        public void InitModel();
    }

    public class TrafficGameModel : AbstractModel, ITrafficGameModel
    {
        /* ------------------------------------------------------------------------- 属性 ---------------------------------------------------------------------------- */

        /* ---------------------------------------------- 局内数据 --------------------------------------------- */

        // 读表

        // 血量
        public BindableProperty<int> HP { get; set; } = new BindableProperty<int>();

        // 局内活跃的车 数组


        /* ------------------------------------------------------------------------- 生命周期 ---------------------------------------------------------------------------- */

        protected override void OnInit()
        {
            
        }

        /* ------------------------------------------------------------------------- API函数 ---------------------------------------------------------------------------- */

        public void InitModel()
        {
            // 反序列化读表，初始化局内属性

            // HP
            HP.Value = 66;
        }
    }
}
